FKDD_COPY_DIFF_3_2026-02-14/Reports/КассоваяКнига.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>КассоваяКнига</Name>
			<Comment>Кассовая книга</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала отчета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Дата окончания отчета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Comment>Вид отчета: обороты, остатки, остатки и обороты</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыводаОтчета</Name>
					<Comment>Режим отображения: табличный документ, сводная таблица, диаграмма</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыводаОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФормыНастроек</Name>
					<Comment>Текущее имя формы настроек</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакетаОформленияТабличногоДокумента</Name>
					<Comment>Имя макета оформления табличного документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаКомпании</Name>
					<Comment>Касса компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
					<Comment>Сохраненные настройки отчета</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПересчитыватьНомера</Name>
					<Comment>Пересчитывать номера кассовой книги</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьОснования</Name>
					<Comment>Выводить документы-основания кассовых ордеров</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>пкПоследнийЛист</Name>
					<Comment>Вид последнего листа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьОбложки</Name>
					<Comment>Печать обложки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/AccumulationRegisters/ДенежныеСредстваКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваКомпании</Name>
			<Comment>Блок учета денежные средства компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте банковского счета (кассы)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Comment>Статья движений денежных средств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта хранения денежных средств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>Структурная единица (расчетный счет, касса компании, касса ККМ, ценная бумага) - место хранения денежных средств.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыКомпании</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/СведенияКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СведенияКомпании</Name>
			<Comment>Некоторые сведения о компании которые могут измениться со временем (например гл. бухгалтер, руководитель...)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение сведения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:EnumRef.СтратегияСписанияПартийТоваровПоСтатусам</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:EnumRef.СтратегияСписанияПартийТоваровПоДатам</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Вид сведения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовСведений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ВидыОбъектовСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовСведений</Name>
			<Comment>Виды объектов сведений</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
					<Comment>Руководитель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Comment>Главный бухгалтер</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
					<Comment>Кассир</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Материально ответственное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтратегияСписанияПоДатам</Name>
					<Comment>Стратегия списания партий товаров по датам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтратегияСписанияПоСтатусам</Name>
					<Comment>Стратегия списания партий товаров по статусам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокПоставки</Name>
					<Comment>Срок поставки</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/ПереоценкаВалютныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПереоценкаВалютныхСредств</Name>
			<Comment>Переоценка валютных средств</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.КассыККМ</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыКомпании</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваКомпании</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентированныйУчет</Name>
					<Comment>Флаг отражения документа в регламентированном учете</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Comment>Статья движения денежных средств по которой производится переоценка валютных средств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс валюты документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсовыеРазницыВзаиморасчетыКомпании</Name>
					<Comment>Истина - закрыть курсовые разницы по взаиморасчетам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсовыеРазницыДенежныеСредстваКомпании</Name>
					<Comment>Истина - закрыть курсовые разницы по денежным средствам компании</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммовыеРазницы</Name>
					<Comment>Истина - закрыть суммовые разницы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсовыеРазницыКассыККМ</Name>
					<Comment>Истина - закрыть курсовые разницы по кассам ККМ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВалютыУпр</Name>
					<Comment>Курс валюты управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата создания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Comment>Дата операции</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Reports/КассоваяКнига/Ext/ObjectModule.bsl
#Если Клиент Тогда
// Модуль отчета

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем МакетОтчета, ОформлениеСтроки; // оформления
Перем ВалютнаяСуммаПоЛисту; // сумма в валюте
Перем МассивМесяцев; // массив с месяцами

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// формирует отчет в виде табличного документа
//
// Параметры
//  ДокРезультат – ТабличныйДокумент или ПолеТабличногоДокумента
//
// Возвращаемое значение:
//  ДокРезультат - ТабличныйДокумент
//
Функция СформироватьТабличныйДокумент (ДокРезультат=Неопределено) Экспорт
	Если ТипЗнч(ДокРезультат) <> Тип("ПолеТабличногоДокумента") И ТипЗнч(ДокРезультат) <> Тип("ТабличныйДокумент") Тогда
		ДокРезультат = Новый ТабличныйДокумент();
	Иначе ДокРезультат.Очистить();
	КонецЕсли;
	
	ДокРезультат.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	
	// проверим корректность заполнения
	Если ДатаНачала > ДатаКонца И ДатаКонца <> '00010101000000' Тогда
		Предупреждение("Дата начала периода не может быть больше даты конца периода", 60);
		Возврат ДокРезультат;
	КонецЕсли;
	
	Если (Месяц(ДатаНачала) = Месяц(ДатаКонца)) 
		И (Год(ДатаНачала) = Год(ДатаКонца)) Тогда
		МесяцОтчета = МассивМесяцев[Месяц(ДатаНачала)];
	КонецЕсли;
	
	// проверим организацию
	Если обЗначениеНеЗаполнено(Организация) Тогда
		Предупреждение("Не указана организация!",5);
		Возврат ДокРезультат;
	КонецЕсли;
	
	//// проверим кассу компании
	//Если обЗначениеНеЗаполнено(КассаКомпании) Тогда
	//	Предупреждение("Не указана касса компании!",5);
	//	Возврат ДокРезультат;
	//КонецЕсли;
	
	Если обЗначениеНеЗаполнено(КассаКомпании) Тогда
		Запрос = Новый Запрос("
		|	ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КассыКомпании.Наименование,
		|	КассыКомпании.ВалютаДенежныхСредств,
		|	КассыКомпании.МноговалютнаяКасса,
		|	КассыКомпании.Представление,
		|	КассыКомпании.Ссылка
		|ИЗ
		|	Справочник.КассыКомпании КАК КассыКомпании
		|ГДЕ
		|	КассыКомпании.Организация = &Организация");
		Запрос.УстановитьПараметр("Организация", Организация);
		МассивКассКомпании = Запрос.Выполнить().Выгрузить();
		
		Для каждого ВыборкаКассы Из МассивКассКомпании Цикл    
			Касса = ВыборкаКассы.Ссылка;	
			
			// получим макеты для результата и обложки
			МакетОтчета = ПолучитьМакет("КассоваяКнига");
			МакетОбложки = ПолучитьМакет("Обложка");
			
			Многовалютная = Касса.МноговалютнаяКасса;
			НомерЛиста = Неопределено;
			НачалоПериода = НачалоДня(ДатаНачала);
			КонецПериода = КонецДня(ДатаКонца);
			Если ПересчитыватьНомера Тогда
				НачалоПериода = НачалоГода(НачалоПериода);	
			КонецЕсли;
			// получим итоги по дням
			ЗапросИтоги = Новый Запрос();
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДенежныеСредстваКомпанииОстаткиИОбороты.Период КАК Период,
			|	ДенежныеСредстваКомпанииОстаткиИОбороты.Валюта КАК Валюта,
			|	ДенежныеСредстваКомпанииОстаткиИОбороты.СуммаНачальныйОстаток КАК НачальныйОстаток,
			|	ДенежныеСредстваКомпанииОстаткиИОбороты.СуммаКонечныйОстаток КАК КонечныйОстаток,
			|	ДенежныеСредстваКомпанииОстаткиИОбороты.СуммаПриход КАК ПриходЗаДень,
			|	ДенежныеСредстваКомпанииОстаткиИОбороты.СуммаРасход КАК РасходЗаДень
			|ИЗ
			|	РегистрНакопления.ДенежныеСредстваКомпании.ОстаткиИОбороты(&ДатаНачала, &ДатаКонца, День, Движения, СтруктурнаяЕдиница = &Касса) КАК ДенежныеСредстваКомпанииОстаткиИОбороты
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период,
			|	Валюта
			|ИТОГИ
			|	СУММА(НачальныйОстаток),
			|	СУММА(КонечныйОстаток),
			|	СУММА(ПриходЗаДень),
			|	СУММА(РасходЗаДень)
			|ПО
			|	Период ПЕРИОДАМИ(ДЕНЬ, , ),
			|	Валюта";
			ЗапросИтоги.Текст = ТекстЗапроса;
			ЗапросИтоги.УстановитьПараметр("ДатаНачала",НачалоПериода);
			ЗапросИтоги.УстановитьПараметр("ДатаКонца",КонецПериода);
			ЗапросИтоги.УстановитьПараметр("Касса",Касса);
			ВыборкаИтогиДни = ЗапросИтоги.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			// получим выборку операций по кассе за период   			
			ЗапросДни = Новый Запрос();
			ЗапросДни.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НАЧАЛОПЕРИОДА(ДенежныеСредстваКомпании.Период, ГОД) КАК ГОД,
			|	НАЧАЛОПЕРИОДА(ДенежныеСредстваКомпании.Период, МЕСЯЦ) КАК МЕСЯЦ,
			|	НАЧАЛОПЕРИОДА(ДенежныеСредстваКомпании.Период, ДЕНЬ) КАК Период,
			|	ДенежныеСредстваКомпании.Период КАК Секунда,
			|	ДенежныеСредстваКомпании.Регистратор КАК Документ,
			|	ДенежныеСредстваКомпании.Регистратор.Номер КАК НомерДок,
			|	ВЫБОР
			|		КОГДА ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
			|			ТОГДА ""Принято от ""
			|		КОГДА ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
			|			ТОГДА ""Выдано ""
			|		ИНАЧЕ ДенежныеСредстваКомпании.СтатьяДДС
			|	КОНЕЦ КАК СтрокаДДС,
			|	ДенежныеСредстваКомпании.Регистратор.Контрагент КАК Контрагент,
			|	ДенежныеСредстваКомпании.Регистратор.Основание КАК Основание,
			|	ДенежныеСредстваКомпании.Регистратор.ВалютаДокумента КАК Валюта,
			|	ДенежныеСредстваКомпании.Регистратор.СтатьяДДС.КоррСчет КАК КоррСчет,
			|	ВЫБОР
			|		КОГДА ДенежныеСредстваКомпании.ВидДвижения = &Приход
			|			ТОГДА ДенежныеСредстваКомпании.Сумма
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Приход,
			|	ВЫБОР
			|		КОГДА ДенежныеСредстваКомпании.ВидДвижения = &Расход
			|			ТОГДА ДенежныеСредстваКомпании.Сумма
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Расход,
			|	ВЫБОР
			|		КОГДА ДенежныеСредстваКомпании.ВидДвижения = &Приход
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК КоличествоПриходных,
			|	ВЫБОР
			|		КОГДА ДенежныеСредстваКомпании.ВидДвижения = &Расход
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК КоличествоРасходных
			|ИЗ
			|	РегистрНакопления.ДенежныеСредстваКомпании КАК ДенежныеСредстваКомпании
			|ГДЕ
			|	ДенежныеСредстваКомпании.СтруктурнаяЕдиница = &Касса
			|	И ДенежныеСредстваКомпании.Период МЕЖДУ &ДатаНачала И &ДатаКонца
			|	И (НЕ ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.ПереоценкаВалютныхСредств)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ГОД,
			|	МЕСЯЦ,
			|	Период,
			|	Секунда
			|ИТОГИ
			|	СУММА(КоличествоПриходных),
			|	СУММА(КоличествоРасходных)
			|ПО
			|	ГОД,
			|	МЕСЯЦ,
			|	Период";
			ЗапросДни.УстановитьПараметр("ДатаНачала",НачалоПериода);
			ЗапросДни.УстановитьПараметр("ДатаКонца",КонецПериода);
			ЗапросДни.УстановитьПараметр("Касса",Касса);
			ЗапросДни.УстановитьПараметр("Приход",ВидДвиженияНакопления.Приход);
			ЗапросДни.УстановитьПараметр("Расход",ВидДвиженияНакопления.Расход);	
			
			// Получим нужные области макета
			ИмяОбласти = ?(ВыводитьОснования,"Широкая","") + ?(Многовалютная,"Многовалютная","");
			ОбластьМакетаВкладнойЛист	= МакетОтчета.ПолучитьОбласть("ВкладнойЛист|Отчет");
			ОбластьМакетаОтчетКассира	= МакетОтчета.ПолучитьОбласть("ОтчетКассира|Отчет");
			ОбластьМакетаШапка			= МакетОтчета.ПолучитьОбласть("Шапка|Отчет");
			ОбластьМакетаОстатокНаНД	= МакетОтчета.ПолучитьОбласть("ОстатокНаНД|Отчет");
			ОбластьМакетаСтрока			= МакетОтчета.ПолучитьОбласть("Строка"+ИмяОбласти+"|Отчет");
			ОбластьМакетаПеренос		= МакетОтчета.ПолучитьОбласть("Перенос|Отчет");
			ОбластьМакетаОборот			= МакетОтчета.ПолучитьОбласть("Оборот|Отчет");
			ОбластьМакетаОборотРуб		= МакетОтчета.ПолучитьОбласть("ОборотРуб|Отчет");	
			ОбластьМакетаОборотВал		= МакетОтчета.ПолучитьОбласть("ОборотВал|Отчет");		
			ОбластьМакетаКонечныйОстаток= МакетОтчета.ПолучитьОбласть("КонечныйОстаток|Отчет");
			ОбластьМакетаПодвал			= МакетОтчета.ПолучитьОбласть("Подвал|Отчет");
			ОбластьМакетаЛистовЗаМесяц	= МакетОтчета.ПолучитьОбласть("ЛистовЗаМесяц|Отчет");
			ОбластьМакетаЛистовЗаГод	= МакетОтчета.ПолучитьОбласть("ЛистовЗаГод|Отчет");
			ОбластьМакетаВТомЧисле		= МакетОтчета.ПолучитьОбласть("ВТомЧисле|Отчет");	
			ОбластьМакетаОстаток		= МакетОтчета.ПолучитьОбласть("Остаток|Отчет");		
			ОбластьМакетаВалОстаток		= МакетОтчета.ПолучитьОбласть("ВалОстаток|Отчет");			
			
			// Заполним постоянные параметры областей
			СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(ДатаКонца,Новый Структура("Организация,Объект",Организация,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер));
			ГлавныйБухгалтер = СтруктураСведений.Значение;
			СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(ДатаКонца,Новый Структура("Организация,Объект",Организация,Перечисления.ВидыОбъектовСведений.Кассир));
			Кассир = СтруктураСведений.Значение;
			СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(ДатаКонца,Новый Структура("Организация,Объект",Организация,Перечисления.ВидыОбъектовСведений.Руководитель));
			Руководитель = СтруктураСведений.Значение;
			ОбластьМакетаПодвал.Параметры.ГлавныйБухгалтер = ГлавныйБухгалтер;
			ОбластьМакетаПодвал.Параметры.Кассир = Кассир;	
			
			счИтоги = 0;
			РезультатЗапроса = ЗапросДни.Выполнить();
			ВыборкаГоды = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Год");
			Количество = РезультатЗапроса.Выбрать().Количество();
			сч = 0;
			ОтборНомера = Новый Структура("Касса",Касса);
			Пока ВыборкаГоды.Следующий() Цикл
				сч = сч + 1;
				ВыборкаМесяца = ВыборкаГоды.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Месяц");
				счДеньГода = 0; КоличествоДнейВГоду = ВыборкаГоды.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Период").Количество();		
				Пока ВыборкаМесяца.Следующий() Цикл
					сч = сч + 1;			
					ВыборкаДни = ВыборкаМесяца.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Период");
					счДеньМесяца = 0;
					КоличествоДнейВМесяце = ВыборкаДни.Количество();
					Пока ВыборкаДни.Следующий() Цикл
						Если ПересчитыватьНомера Тогда
							Состояние("Пересчитываются номера листов кассовой книги за " + Формат(ВыборкаДни.Период,"ДЛФ=DD"));	
						КонецЕсли;
						сч = сч + 1;							
						// Для первого дня необходимо вывести номер листа, следующий за сохраненным номером листа
						Если НомерЛиста = Неопределено И ПересчитыватьНомера Тогда
							НомерЛиста = 1;
							ЛистовЗаМесяц = 1;
							ЛистовЗаГод = 1;
							// создадим и очистим весь набор записей
							Номера = РегистрыСведений.НомераЛистовКассовойКниги.СоздатьНаборЗаписей();
							Номера.Отбор.КассаКомпании.Установить(Касса);
							Номера.Прочитать();
							Номера.Очистить();
						КонецЕсли;
						Если НомерЛиста = Неопределено Тогда
							ЗапросНомера = Новый Запрос();
							ЗапросНомера.Текст = "
							|ВЫБРАТЬ РАЗРЕШЕННЫЕ
							|	ЕСТЬNULL(НомерПоследнегоЛистаПредМесяц.НомерЛиста, 1) КАК НомерПоследнегоЛистаЗаПредМесяц,
							|	НомерПоследнегоЛистаЗаЭтотМесяц.НомерЛиста КАК НомерПоследнегоЛистаЗаЭтотМесяц
							|ИЗ
							|	РегистрСведений.НомераЛистовКассовойКниги.СрезПоследних(
							|		&НачалоМесяца,
							|		КассаКомпании = &Касса
							|		    И НАЧАЛОПЕРИОДА(Период, ГОД) = &НачалоГода) КАК НомерПоследнегоЛистаПредМесяц
							|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.НомераЛистовКассовойКниги.СрезПоследних(
							|		&ДатаНач,
							|		КассаКомпании = &Касса
							|		    И НАЧАЛОПЕРИОДА(Период, ГОД) = &НачалоГода) КАК НомерПоследнегоЛистаЗаЭтотМесяц
							|		ПО (ИСТИНА)
							|";
							ЗапросНомера.УстановитьПараметр("Касса",Касса);
							ЗапросНомера.УстановитьПараметр("НачалоГода",ВыборкаГоды.Год);
							ЗапросНомера.УстановитьПараметр("НачалоМесяца",Новый Граница(ВыборкаМесяца.Месяц,ВидГраницы.Исключая));
							ЗапросНомера.УстановитьПараметр("ДатаНач",Новый Граница(ВыборкаДни.Период,ВидГраницы.Исключая));
							ВыборкаНомера = ЗапросНомера.Выполнить().Выбрать();
							Если ВыборкаНомера.Количество() = 0 Тогда
								НомерЛиста = 1;
								ЛистовЗаМесяц = 1;
								ЛистовЗаГод = 1;
							Иначе
								ВыборкаНомера.Следующий();
								НомерЛиста = ВыборкаНомера.НомерПоследнегоЛистаЗаЭтотМесяц + 1;
								ЛистовЗаГод = НомерЛиста;
								ЛистовЗаМесяц = ВыборкаНомера.НомерПоследнегоЛистаЗаЭтотМесяц - ВыборкаНомера.НомерПоследнегоЛистаЗаПредМесяц + 1;
							КонецЕсли;
						КонецЕсли;
						счДеньГода = счДеньГода + 1;
						счДеньМесяца = счДеньМесяца + 1;				
						// Выведем параметры "дня"
						ОбластьМакетаВкладнойЛист.Параметры.ТекстНомерЛиста = НомерЛиста;
						ОбластьМакетаВкладнойЛист.Параметры.ДатаКассы       = Формат(ВыборкаДни.Период,"ДЛФ=DD"); 
						ДокРезультат.Вывести(ОбластьМакетаВкладнойЛист);
						ДокРезультат.Присоединить(ОбластьМакетаВкладнойЛист);
					//	ОбластьМакетаОтчетКассира.Параметры.ЗаголовокЛиста = "КАССА " + """" + СокрЛП(Строка(Касса)) + """" + " за " + Формат(ВыборкаДни.Период,"ДФ=dd.MM.yyyy"); 				
						//ДокРезультат.Присоединить(ОбластьМакетаОтчетКассира);				
						//ОбластьМакетаШапка.Параметры.ТекстНомерЛиста = НомерЛиста;			
						ДокРезультат.Вывести(ОбластьМакетаШапка);
						ДокРезультат.Присоединить(ОбластьМакетаШапка);				
						// Перейдем к следующей итоговой записи, совпадающей с этим днем и выведем все валюты
						ВыборкаИтогиВалюты = ВыборкаИтогиДни.Строки[счИтоги].Строки;
						счИтоги = счИтоги + 1;
						Для Каждого СтрокаИтогиВалюты ИЗ ВыборкаИтогиВалюты Цикл
							ОбластьМакетаОстатокНаНД.Параметры.НачальныйОстаток = СтрокаИтогиВалюты.НачальныйОстаток;
							Если Многовалютная Тогда
								ОбластьМакетаОстатокНаНД.Параметры.Валюта = " (" + СтрокаИтогиВалюты.Валюта + ")";
							КонецЕсли;
							ДокРезультат.Вывести(ОбластьМакетаОстатокНаНД);					
							ДокРезультат.Присоединить(ОбластьМакетаОстатокНаНД);										
						КонецЦикла;
						
						// Начинаем выводить документы дня
						ПриходРасходПоЛисту = Новый Соответствие();
						ЛистовЗаДень = 0;
						ВыборкаДокументы = ВыборкаДни.Выбрать();
						счСтроки = 1;
						Пока ВыборкаДокументы.Следующий() Цикл
							сч = сч + 1;
							ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаДокументы);
							ОбластьМакетаСтрока.Параметры.Контрагент = Строка(ВыборкаДокументы.СтрокаДДС) + ВыборкаДокументы.Контрагент + ?(ВыводитьОснования," " + ВыборкаДокументы.Основание,"");
							Если Многовалютная Тогда
								ИмяПараметра = "Валюта" + ?(ВыборкаДокументы.Приход <> 0, "Приход","Расход");
								ОбластьМакетаСтрока.Параметры[ИмяПараметра] = ВыборкаДокументы.Валюта;
							КонецЕсли;
							
							// Если не хватает для вывода места, переносим на следующий лист, увеличивая номер листа и обнуляя итоги по листу
							МассивПроверки = Новый Массив();
							МассивПроверки.Добавить(ОбластьМакетаСтрока);
							Для к = 1 По ПриходРасходПоЛисту.Количество() Цикл
								МассивПроверки.Добавить(ОбластьМакетаПеренос);
							КонецЦикла;
							
							Если ВыборкаДокументы.Количество() = счСтроки Тогда
								МассивПроверки.Добавить(ОбластьМакетаПодвал);
							КонецЕсли;

							Попытка
								РезультатПроверки = ДокРезультат.ПроверитьВывод(МассивПроверки);
								//проверим, помещаются ли на странице
								Если НЕ РезультатПроверки Тогда
									Для Каждого ТекВалюта Из ПриходРасходПоЛисту Цикл
										Если Многовалютная Тогда
											ОбластьМакетаПеренос.Параметры.Валюта = " (" + ТекВалюта.Ключ + ")";
										КонецЕсли;
										ОбластьМакетаПеренос.Параметры.Заполнить(ТекВалюта.Значение);
										ДокРезультат.Вывести(ОбластьМакетаПеренос);
										ДокРезультат.Присоединить(ОбластьМакетаПеренос);
									КонецЦикла;
									ДокРезультат.ВывестиГоризонтальныйРазделительСтраниц();
									НомерЛиста		= НомерЛиста	+ 1;
									ЛистовЗаДень	= ЛистовЗаДень	+ 1;
									ЛистовЗаМесяц	= ЛистовЗаМесяц	+ 1;
									ЛистовЗаГод		= ЛистовЗаГод	+ 1;
									//ОбластьМакетаШапка.Параметры.ТекстНомерЛиста = НомерЛиста;
									ДокРезультат.Вывести(ОбластьМакетаШапка);
									ДокРезультат.Присоединить(ОбластьМакетаШапка);						
									ПриходРасходПоЛисту = Новый Соответствие();
								КонецЕсли;
							Исключение
							КонецПопытки;	
							
							ДокРезультат.Вывести(ОбластьМакетаСтрока);
							счСтроки = счСтроки + 1;
							ДокРезультат.Присоединить(ОбластьМакетаСтрока);
							
							// Заполним структуру итогов по листу
							ПриходРасход = Неопределено;
							ПриходРасход = ПриходРасходПоЛисту.Получить(ВыборкаДокументы.Валюта);
							ПриходРасход = ?(ПриходРасход = Неопределено, Новый Структура("Приход,Расход",0,0), ПриходРасход);
							ПриходРасход.Приход = ПриходРасход.Приход + ВыборкаДокументы.Приход;
							ПриходРасход.Расход = ПриходРасход.Расход + ВыборкаДокументы.Расход;
							ПриходРасходПоЛисту.Вставить(ВыборкаДокументы.Валюта, ПриходРасход);
						КонецЦикла; // по документам 
						
						// Если у нас день растянулся на несколько листов, тогда выведем итог по последнему листу
						Если ЛистовЗаДень > 0 Тогда
							Для каждого ТекВалюта Из ПриходРасходПоЛисту Цикл
								Если Многовалютная Тогда
									ОбластьМакетаПеренос.Параметры.Валюта = " (" + ТекВалюта.Ключ + ")";
								КонецЕсли;
								ОбластьМакетаПеренос.Параметры.Заполнить(ТекВалюта.Значение);
								ДокРезультат.Вывести(ОбластьМакетаПеренос);
								ДокРезультат.Присоединить(ОбластьМакетаПеренос);
							КонецЦикла;
						КонецЕсли; 
						
						//составление надписи подвала для приходных и расходных ордеров
						ЕстьПриходный = Ложь;
						ЕстьРасходный = Ложь; 
						Если ВыборкаДни.КоличествоПриходных = 0 Тогда    
							ЕстьПриходный = Истина;
							ПриходныеПолучил = Символ(8211)+ " приходных";
						ИначеЕсли ВыборкаДни.КоличествоПриходных = 1 Тогда
							ЕстьПриходный = Истина;
							ПриходныеПолучил = "один приходный";
						ИначеЕсли ВыборкаДни.КоличествоПриходных > 1 Тогда
							ЕстьПриходный = Истина;
							ПриходныеПолучил = НРег(ЧислоПрописью(ВыборкаДни.КоличествоПриходных,"НД=Ложь",",,,,,,,,0")) + "приходных";
						КонецЕсли; 
						Если ВыборкаДни.КоличествоРасходных = 0 Тогда    
							ЕстьРасходный = Истина;
							РасходныеПолучил = Символ(8211)+ " расходных";
						ИначеЕсли ВыборкаДни.КоличествоРасходных = 1 Тогда
							ЕстьРасходный = Истина;
							РасходныеПолучил = "один расходный";
						ИначеЕсли ВыборкаДни.КоличествоРасходных > 1 Тогда
							ЕстьРасходный = Истина;
							РасходныеПолучил = НРег(ЧислоПрописью(ВыборкаДни.КоличествоРасходных,"НД=Ложь",",,,,,,,,0")) + "расходных";
						КонецЕсли; 
						Если ЕстьПриходный И ЕстьРасходный Тогда    
							ВставкаИ = " и ";
						Иначе
							ВставкаИ = "";
						КонецЕсли; 
						ОбластьМакетаПодвал.Параметры.НадписьКолПриходныхРасходных = ПриходныеПолучил + ВставкаИ + РасходныеПолучил + " получил.";
						
						// Выводя подвальные секции, проверим, не перескочили ли мы на следующую страницу
						МассивПроверки = Новый Массив();
						Для Каждого СтрокаИтогиВалюты Из ВыборкаИтогиВалюты Цикл
							МассивПроверки.Добавить(ОбластьМакетаОборот);					
							МассивПроверки.Добавить(ОбластьМакетаКонечныйОстаток);								
						КонецЦикла;
						МассивПроверки.Добавить(ОбластьМакетаПодвал);
						
						// вычислим, возможно это последний в месяце день или в году, тогда выведем количество листов
						ПоследнийВМесяце = Ложь; ПоследнийВГоду = Ложь;
						
						Если сч = Количество Тогда
							Если пкПоследнийЛист > 0 Тогда
								ПоследнийВМесяце = Истина;
								МассивПроверки.Добавить(ОбластьМакетаЛистовЗаМесяц);
								
								//Если пкПоследнийЛист = 1 Тогда ПоследнийВГоду = ЛОЖЬ; КонецЕсли;
								ПоследнийВГоду = НЕ (пкПоследнийЛист = 1);
								Если ПоследнийВГоду Тогда
									МассивПроверки.Добавить(ОбластьМакетаЛистовЗаГод);
								КонецЕсли;
							Иначе
								ПоследнийВМесяце	= ЛОЖЬ;
								ПоследнийВГоду		= ЛОЖЬ;
							КонецЕсли;
						Иначе
							Если счДеньГода = КоличествоДнейВГоду Тогда
								ПоследнийВГоду = Истина;
								МассивПроверки.Добавить(ОбластьМакетаЛистовЗаГод);
							КонецЕсли;
							Если счДеньМесяца = КоличествоДнейВМесяце Тогда
								ПоследнийВМесяце = Истина;
								МассивПроверки.Добавить(ОбластьМакетаЛистовЗаМесяц);
							КонецЕсли;
						КонецЕсли;
						
						Попытка
							РезультатПроверки = ДокРезультат.ПроверитьВывод(МассивПроверки);
							Если НЕ РезультатПроверки Тогда
								НомерЛиста = НомерЛиста + 1;
								ЛистовЗаМесяц = ЛистовЗаМесяц + 1;
								ЛистовЗаГод = ЛистовЗаГод + 1;
								//ОбластьМакетаШапка.Параметры.ТекстНомерЛиста = НомерЛиста;
							КонецЕсли;
						Исключение
						КонецПопытки;	
						
						//Выведем все обороты по валютам  
						Для Каждого СтрокаИтогиВалюты Из ВыборкаИтогиВалюты Цикл
							ОбластьМакетаОборот.Параметры.ПриходЗаДень = СтрокаИтогиВалюты.ПриходЗаДень;
							ОбластьМакетаОборот.Параметры.РасходЗаДень = СтрокаИтогиВалюты.РасходЗаДень;					
							Если Многовалютная Тогда
								ОбластьМакетаОборот.Параметры.Валюта = " (" + СтрокаИтогиВалюты.Валюта + ")";					
							КонецЕсли;
							ДокРезультат.Вывести(ОбластьМакетаОборот);
							ДокРезультат.Присоединить(ОбластьМакетаОборот);					
						КонецЦикла;
						
						//Выведем все остатки на конец дня по валютам 
						Для Каждого СтрокаИтогиВалюты Из ВыборкаИтогиВалюты Цикл
							ОбластьМакетаКонечныйОстаток.Параметры.ОстатокКонец = СтрокаИтогиВалюты.КонечныйОстаток;
							Если Многовалютная Тогда
								ОбластьМакетаКонечныйОстаток.Параметры.Валюта = " (" + СтрокаИтогиВалюты.Валюта + ")";										
							КонецЕсли;
							ДокРезультат.Вывести(ОбластьМакетаКонечныйОстаток);
							ДокРезультат.Присоединить(ОбластьМакетаКонечныйОстаток);					
						КонецЦикла;
						
						ДокРезультат.Вывести(ОбластьМакетаПодвал);
						ДокРезультат.Присоединить(ОбластьМакетаПодвал);				
						
						Если сч = Количество Тогда //Это вообще последний лист в печати
							Если ПечатьОбложки Тогда
								// Печать обложки и титульного листа
								ДокументОбложка = Новый ТабличныйДокумент;
								ОбластьОбложка = МакетОбложки.ПолучитьОбласть("Обложка");
								ОбластьОбложка.Параметры.ПредставлениеОрганизации = спПолучитьПредставление(Организация);
								ОбластьОбложка.Параметры.Организация = Организация;						
								ОбластьОбложка.Параметры.НадписьОбложка = " на " + ?(МесяцОтчета <> Неопределено, МесяцОтчета + " ", "") + Формат(Год(ВыборкаДни.Период),"ЧГ=0") + " г.";
								ОбластьОбложка.Параметры.КодОКПО = Организация.КодПоОКПО;	
								ДокументОбложка.Вывести(ОбластьОбложка);
								ДокументОбложка.ВывестиГоризонтальныйРазделительСтраниц();
								ДокументОбложка.Вывести(ОбластьОбложка);
								//Последний лист кассовой книги
								ДокументОбложка.ВывестиГоризонтальныйРазделительСтраниц();
								ОбластьПослДеньГода = МакетОбложки.ПолучитьОбласть("ПослДеньГода");
								ОбластьПослДеньГода.Параметры.ГлавныйБухгалтерПредставление = ГлавныйБухгалтер;
								ОбластьПослДеньГода.Параметры.ГлавныйБухгалтер = ГлавныйБухгалтер;						
								ОбластьПослДеньГода.Параметры.РуководительПредставление = Руководитель;
								ОбластьПослДеньГода.Параметры.Руководитель = Руководитель;						
								ОбластьПослДеньГода.Параметры.РуководительДолжность = ?(ОбЗначениеНеЗаполнено(Руководитель),"",Руководитель.Должность);
								ОбластьПослДеньГода.Параметры.ЛистовЗаГод = ЛистовЗаГод;
								ДокументОбложка.Вывести(ОбластьПослДеньГода);
								ДокументОбложка.ОтображатьСетку = Ложь;
								ДокументОбложка.ОтображатьЗаголовки = Ложь;
								ДокументОбложка.ТолькоПросмотр = Истина;
								ДокументОбложка.Показать("Обложка и титульный лист кассовой книги","");
							КонецЕсли;
						КонецЕсли;
						
						Если ПоследнийВМесяце Тогда
							ОбластьМакетаЛистовЗаМесяц.Параметры.НадписьЛистовЗаМесяц = "Количество листов кассовой книги за месяц: " + ЛистовЗаМесяц;
							ДокРезультат.Вывести(ОбластьМакетаЛистовЗаМесяц);
							ДокРезультат.Присоединить(ОбластьМакетаЛистовЗаМесяц)					
						КонецЕсли;
						
						Если ПоследнийВГоду Тогда
							ОбластьМакетаЛистовЗаГод.Параметры.НадписьЛистовЗаГод = "Количество листов кассовой книги за год: " + ЛистовЗаГод;
							ДокРезультат.Вывести(ОбластьМакетаЛистовЗаГод);
							ДокРезультат.Присоединить(ОбластьМакетаЛистовЗаГод);					
						КонецЕсли;
						
						// Сохраним значение с количеством листов
						Если ПересчитыватьНомера Тогда
							ДеньЛиста = Номера.Добавить();					
						Иначе
							ДеньЛиста = РегистрыСведений.НомераЛистовКассовойКниги.СоздатьМенеджерЗаписи();
						КонецЕсли;
						ДеньЛиста.Период = ВыборкаДни.Период;
						ДеньЛиста.КассаКомпании = Касса;
						ДеньЛиста.НомерЛиста = ЛистовЗаГод;
						Если Не ПересчитыватьНомера Тогда
							ДеньЛиста.Записать();	
						КонецЕсли;
						//переход на следующий день
						ДокРезультат.ВывестиГоризонтальныйРазделительСтраниц();
						//если номера пересчитываем, а дата начала еще не настала то необходимо очистить документ
						Если ПересчитыватьНомера И ВыборкаДни.Период < НачалоДня(ДатаНачала) Тогда
							ДокРезультат.Очистить();
						КонецЕсли;	
						НомерЛиста		= НомерЛиста + 1;
						ЛистовЗаМесяц	= ЛистовЗаМесяц + 1;
						ЛистовЗаГод		= ЛистовЗаГод + 1;
						//ОбластьМакетаШапка.Параметры.ТекстНомерЛиста = НомерЛиста;	
					КонецЦикла; // по дням
					ЛистовЗаМесяц = 1;							
				КонецЦикла; // по месяцам 
				ЛистовЗаГод = 1;
				НомерЛиста = 1;
				// Сохраним созданный набор записей
				Если ПересчитыватьНомера Тогда
					Номера.Записать();
				КонецЕсли;
			КонецЦикла; // по годам	
		КонецЦикла;
	Иначе 		
		// получим макеты для результата и обложки
		МакетОтчета = ПолучитьМакет("КассоваяКнига");
		МакетОбложки = ПолучитьМакет("Обложка");
		
		Многовалютная = КассаКомпании.МноговалютнаяКасса;
		НомерЛиста = Неопределено;
		НачалоПериода = НачалоДня(ДатаНачала);
		КонецПериода = КонецДня(ДатаКонца);
		Если ПересчитыватьНомера Тогда
			НачалоПериода = НачалоГода(НачалоПериода);	
		КонецЕсли;
		// получим итоги по дням
		ЗапросИтоги = Новый Запрос();
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДенежныеСредстваКомпанииОстаткиИОбороты.Период КАК Период,
		|	ДенежныеСредстваКомпанииОстаткиИОбороты.Валюта КАК Валюта,
		|	ДенежныеСредстваКомпанииОстаткиИОбороты.СуммаНачальныйОстаток КАК НачальныйОстаток,
		|	ДенежныеСредстваКомпанииОстаткиИОбороты.СуммаКонечныйОстаток КАК КонечныйОстаток,
		|	ДенежныеСредстваКомпанииОстаткиИОбороты.СуммаПриход КАК ПриходЗаДень,
		|	ДенежныеСредстваКомпанииОстаткиИОбороты.СуммаРасход КАК РасходЗаДень
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваКомпании.ОстаткиИОбороты(&ДатаНачала, &ДатаКонца, День, Движения, СтруктурнаяЕдиница = &КассаКомпании) КАК ДенежныеСредстваКомпанииОстаткиИОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	Валюта
		|ИТОГИ
		|	СУММА(НачальныйОстаток),
		|	СУММА(КонечныйОстаток),
		|	СУММА(ПриходЗаДень),
		|	СУММА(РасходЗаДень)
		|ПО
		|	Период ПЕРИОДАМИ(ДЕНЬ, , ),
		|	Валюта";
		ЗапросИтоги.Текст = ТекстЗапроса;
		ЗапросИтоги.УстановитьПараметр("ДатаНачала",НачалоПериода);
		ЗапросИтоги.УстановитьПараметр("ДатаКонца",КонецПериода);
		ЗапросИтоги.УстановитьПараметр("КассаКомпании",КассаКомпании);
		ВыборкаИтогиДни = ЗапросИтоги.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		// получим выборку операций по кассе за период
		
		ЗапросДни = Новый Запрос();
		ЗапросДни.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(ДенежныеСредстваКомпании.Период, ГОД) КАК ГОД,
		|	НАЧАЛОПЕРИОДА(ДенежныеСредстваКомпании.Период, МЕСЯЦ) КАК МЕСЯЦ,
		|	НАЧАЛОПЕРИОДА(ДенежныеСредстваКомпании.Период, ДЕНЬ) КАК Период,
		|	ДенежныеСредстваКомпании.Период КАК Секунда,
		|	ДенежныеСредстваКомпании.Регистратор КАК Документ,
		|	ДенежныеСредстваКомпании.Регистратор.Номер КАК НомерДок,
		|	ВЫБОР
		|		КОГДА ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
		|			ТОГДА ""Принято от ""
		|		КОГДА ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
		|			ТОГДА ""Выдано ""
		|		ИНАЧЕ ДенежныеСредстваКомпании.СтатьяДДС
		|	КОНЕЦ КАК СтрокаДДС,
		|	ДенежныеСредстваКомпании.Регистратор.Контрагент КАК Контрагент,
		|	ДенежныеСредстваКомпании.Регистратор.Основание КАК Основание,
		|	ДенежныеСредстваКомпании.Регистратор.ВалютаДокумента КАК Валюта,
		|	ДенежныеСредстваКомпании.Регистратор.СтатьяДДС.КоррСчет КАК КоррСчет,
		|	ВЫБОР
		|		КОГДА ДенежныеСредстваКомпании.ВидДвижения = &Приход
		|			ТОГДА ДенежныеСредстваКомпании.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Приход,
		|	ВЫБОР
		|		КОГДА ДенежныеСредстваКомпании.ВидДвижения = &Расход
		|			ТОГДА ДенежныеСредстваКомпании.Сумма
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Расход,
		|	ВЫБОР
		|		КОГДА ДенежныеСредстваКомпании.ВидДвижения = &Приход
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоПриходных,
		|	ВЫБОР
		|		КОГДА ДенежныеСредстваКомпании.ВидДвижения = &Расход
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоРасходных
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваКомпании КАК ДенежныеСредстваКомпании
		|ГДЕ
		|	ДенежныеСредстваКомпании.СтруктурнаяЕдиница = &КассаКомпании
		|	И ДенежныеСредстваКомпании.Период МЕЖДУ &ДатаНачала И &ДатаКонца
		|	И (НЕ ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.ПереоценкаВалютныхСредств)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ГОД,
		|	МЕСЯЦ,
		|	Период,
		|	Секунда
		|ИТОГИ
		|	СУММА(КоличествоПриходных),
		|	СУММА(КоличествоРасходных)
		|ПО
		|	ГОД,
		|	МЕСЯЦ,
		|	Период";
		ЗапросДни.УстановитьПараметр("ДатаНачала",НачалоПериода);
		ЗапросДни.УстановитьПараметр("ДатаКонца",КонецПериода);
		ЗапросДни.УстановитьПараметр("КассаКомпании",КассаКомпании);
		ЗапросДни.УстановитьПараметр("Приход",ВидДвиженияНакопления.Приход);
		ЗапросДни.УстановитьПараметр("Расход",ВидДвиженияНакопления.Расход);	
		
		// Получим нужные области макета
		ИмяОбласти = ?(ВыводитьОснования,"Широкая","") + ?(Многовалютная,"Многовалютная","");
		ОбластьМакетаВкладнойЛист 	 = МакетОтчета.ПолучитьОбласть("ВкладнойЛист|Отчет");
		ОбластьМакетаОтчетКассира	 = МакетОтчета.ПолучитьОбласть("ОтчетКассира|Отчет");
		ОбластьМакетаШапка			 = МакетОтчета.ПолучитьОбласть("Шапка|Отчет");
		ОбластьМакетаОстатокНаНД	 = МакетОтчета.ПолучитьОбласть("ОстатокНаНД|Отчет");
		ОбластьМакетаСтрока			 = МакетОтчета.ПолучитьОбласть("Строка" + ИмяОбласти + "|Отчет");
		ОбластьМакетаПеренос		 = МакетОтчета.ПолучитьОбласть("Перенос|Отчет");
		ОбластьМакетаОборот			 = МакетОтчета.ПолучитьОбласть("Оборот|Отчет");
		ОбластьМакетаОборотРуб		 = МакетОтчета.ПолучитьОбласть("ОборотРуб|Отчет");	
		ОбластьМакетаОборотВал		 = МакетОтчета.ПолучитьОбласть("ОборотВал|Отчет");		
		ОбластьМакетаКонечныйОстаток = МакетОтчета.ПолучитьОбласть("КонечныйОстаток|Отчет");
		ОбластьМакетаПодвал			 = МакетОтчета.ПолучитьОбласть("Подвал|Отчет");
		ОбластьМакетаЛистовЗаМесяц	 = МакетОтчета.ПолучитьОбласть("ЛистовЗаМесяц|Отчет");
		ОбластьМакетаЛистовЗаГод	 = МакетОтчета.ПолучитьОбласть("ЛистовЗаГод|Отчет");
		ОбластьМакетаВТомЧисле		 = МакетОтчета.ПолучитьОбласть("ВТомЧисле|Отчет");	
		ОбластьМакетаОстаток		 = МакетОтчета.ПолучитьОбласть("Остаток|Отчет");		
		ОбластьМакетаВалОстаток		 = МакетОтчета.ПолучитьОбласть("ВалОстаток|Отчет");			
		
		// Заполним постоянные параметры областей
		СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(ДатаКонца,Новый Структура("Организация,Объект",Организация,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер));
		ГлавныйБухгалтер = СтруктураСведений.Значение;
		СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(ДатаКонца,Новый Структура("Организация,Объект",Организация,Перечисления.ВидыОбъектовСведений.Кассир));
		Кассир = СтруктураСведений.Значение;
		СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(ДатаКонца,Новый Структура("Организация,Объект",Организация,Перечисления.ВидыОбъектовСведений.Руководитель));
		Руководитель = СтруктураСведений.Значение;
		ОбластьМакетаПодвал.Параметры.ГлавныйБухгалтер = ГлавныйБухгалтер;
		ОбластьМакетаПодвал.Параметры.Кассир = Кассир;	
		
		счИтоги = 0;
		РезультатЗапроса = ЗапросДни.Выполнить();
		ВыборкаГоды = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Год");
		Количество = РезультатЗапроса.Выбрать().Количество();
		сч = 0;
		ОтборНомера = Новый Структура("КассаКомпании",КассаКомпании);
		Пока ВыборкаГоды.Следующий() Цикл
			сч = сч + 1;
			ВыборкаМесяца = ВыборкаГоды.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Месяц");
			счДеньГода = 0; КоличествоДнейВГоду = ВыборкаГоды.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Период").Количество();		
			Пока ВыборкаМесяца.Следующий() Цикл
				сч = сч + 1;			
				ВыборкаДни = ВыборкаМесяца.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Период");
				счДеньМесяца = 0; КоличествоДнейВМесяце = ВыборкаДни.Количество();
				Пока ВыборкаДни.Следующий() Цикл
					Если ПересчитыватьНомера Тогда
						Состояние("Пересчитываются номера листов кассовой книги за " + Формат(ВыборкаДни.Период,"ДЛФ=DD"));	
					КонецЕсли;
					сч = сч + 1;							
					// Для первого дня необходимо вывести номер листа, следующий за сохраненным номером листа
					Если НомерЛиста = Неопределено И ПересчитыватьНомера Тогда
						НомерЛиста = 1;
						ЛистовЗаМесяц = 1;
						ЛистовЗаГод = 1;
						// создадим и очистим весь набор записей
						Номера = РегистрыСведений.НомераЛистовКассовойКниги.СоздатьНаборЗаписей();
						Номера.Отбор.КассаКомпании.Установить(КассаКомпании);
						Номера.Прочитать();
						Номера.Очистить();
					КонецЕсли;
					Если НомерЛиста = Неопределено Тогда
						ЗапросНомера = Новый Запрос();
						ЗапросНомера.Текст = "
						|ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|	ЕСТЬNULL(НомерПоследнегоЛистаПредМесяц.НомерЛиста, 1) КАК НомерПоследнегоЛистаЗаПредМесяц,
						|	НомерПоследнегоЛистаЗаЭтотМесяц.НомерЛиста КАК НомерПоследнегоЛистаЗаЭтотМесяц
						|ИЗ
						|	РегистрСведений.НомераЛистовКассовойКниги.СрезПоследних(
						|		&НачалоМесяца,
						|		КассаКомпании = &КассаКомпании
						|		    И НАЧАЛОПЕРИОДА(Период, ГОД) = &НачалоГода) КАК НомерПоследнегоЛистаПредМесяц
						|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.НомераЛистовКассовойКниги.СрезПоследних(
						|		&ДатаНач,
						|		КассаКомпании = &КассаКомпании
						|		    И НАЧАЛОПЕРИОДА(Период, ГОД) = &НачалоГода) КАК НомерПоследнегоЛистаЗаЭтотМесяц
						|		ПО (ИСТИНА)
						|";
						ЗапросНомера.УстановитьПараметр("КассаКомпании", КассаКомпании);
						ЗапросНомера.УстановитьПараметр("НачалоГода", ВыборкаГоды.Год);
						ЗапросНомера.УстановитьПараметр("НачалоМесяца", Новый Граница(ВыборкаМесяца.Месяц,ВидГраницы.Исключая));
						ЗапросНомера.УстановитьПараметр("ДатаНач", Новый Граница(ВыборкаДни.Период,ВидГраницы.Исключая));
						ВыборкаНомера = ЗапросНомера.Выполнить().Выбрать();
						Если ВыборкаНомера.Количество() = 0 Тогда
							НомерЛиста = 1;
							ЛистовЗаМесяц = 1;
							ЛистовЗаГод = 1;
						Иначе
							ВыборкаНомера.Следующий();
							НомерЛиста = ВыборкаНомера.НомерПоследнегоЛистаЗаЭтотМесяц + 1;
							ЛистовЗаГод = НомерЛиста;
							ЛистовЗаМесяц = ВыборкаНомера.НомерПоследнегоЛистаЗаЭтотМесяц - ВыборкаНомера.НомерПоследнегоЛистаЗаПредМесяц + 1;
						КонецЕсли;
					КонецЕсли;
					счДеньГода = счДеньГода + 1;
					счДеньМесяца = счДеньМесяца + 1;				
					// Выведем параметры "дня" 
					ОбластьМакетаВкладнойЛист.Параметры.ТекстНомерЛиста = НомерЛиста;
					ОбластьМакетаВкладнойЛист.Параметры.ДатаКассы       = Формат(ВыборкаДни.Период,"ДЛФ=DD"); 
					ДокРезультат.Вывести(ОбластьМакетаВкладнойЛист);
					ДокРезультат.Присоединить(ОбластьМакетаВкладнойЛист);
					//ОбластьМакетаОтчетКассира.Параметры.ЗаголовокЛиста = "КАССА за " + Формат(ВыборкаДни.Период,"ДФ=dd.MM.yyyy"); 				
					//ДокРезультат.Присоединить(ОбластьМакетаОтчетКассира);				
					//ОбластьМакетаШапка.Параметры.ТекстНомерЛиста = НомерЛиста;			
					ДокРезультат.Вывести(ОбластьМакетаШапка);
					ДокРезультат.Присоединить(ОбластьМакетаШапка);				
					// Перейдем к следующей итоговой записи, совпадающей с этим днем и выведем все валюты
					ВыборкаИтогиВалюты = ВыборкаИтогиДни.Строки[счИтоги].Строки;
					счИтоги = счИтоги + 1;
					Для Каждого СтрокаИтогиВалюты ИЗ ВыборкаИтогиВалюты Цикл
						ОбластьМакетаОстатокНаНД.Параметры.НачальныйОстаток = СтрокаИтогиВалюты.НачальныйОстаток;
						Если Многовалютная Тогда
							ОбластьМакетаОстатокНаНД.Параметры.Валюта = " (" + СтрокаИтогиВалюты.Валюта + ")";
						КонецЕсли;
						ДокРезультат.Вывести(ОбластьМакетаОстатокНаНД);					
						ДокРезультат.Присоединить(ОбластьМакетаОстатокНаНД);										
					КонецЦикла;
					
					// Начинаем выводить документы дня
					ПриходРасходПоЛисту = Новый Соответствие();
					ЛистовЗаДень = 0;
					ВыборкаДокументы = ВыборкаДни.Выбрать();
					счСтроки = 1;
					Пока ВыборкаДокументы.Следующий() Цикл
						сч = сч + 1;
						ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаДокументы);
						ОбластьМакетаСтрока.Параметры.Контрагент = Строка(ВыборкаДокументы.СтрокаДДС) + ВыборкаДокументы.Контрагент + ?(ВыводитьОснования," " + ВыборкаДокументы.Основание,"");
						Если Многовалютная Тогда
							ИмяПараметра = "Валюта" + ?(ВыборкаДокументы.Приход <> 0, "Приход","Расход");
							ОбластьМакетаСтрока.Параметры[ИмяПараметра] = ВыборкаДокументы.Валюта;
						КонецЕсли;
						
						// Если не хватает для вывода места, переносим на следующий лист, увеличивая номер листа и обнуляя итоги по листу
						МассивПроверки = Новый Массив();
						МассивПроверки.Добавить(ОбластьМакетаСтрока);
						Для к = 1 По ПриходРасходПоЛисту.Количество() Цикл
							МассивПроверки.Добавить(ОбластьМакетаПеренос);
						КонецЦикла;
						
						Если ВыборкаДокументы.Количество() = счСтроки Тогда
							МассивПроверки.Добавить(ОбластьМакетаПодвал);
						КонецЕсли;
						
						Попытка
	

							РезультатПроверки = ДокРезультат.ПроверитьВывод(МассивПроверки);
							//проверим, помещаются ли на странице
							Если НЕ РезультатПроверки Тогда
								Для Каждого ТекВалюта Из ПриходРасходПоЛисту Цикл
									Если Многовалютная Тогда
										ОбластьМакетаПеренос.Параметры.Валюта = " (" + ТекВалюта.Ключ + ")";
									КонецЕсли;
									ОбластьМакетаПеренос.Параметры.Заполнить(ТекВалюта.Значение);
									ДокРезультат.Вывести(ОбластьМакетаПеренос);
									ДокРезультат.Присоединить(ОбластьМакетаПеренос);
								КонецЦикла;
								ДокРезультат.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
								ДокРезультат.АвтоМасштаб=Истина;
								ДокРезультат.ВывестиГоризонтальныйРазделительСтраниц();
								НомерЛиста		= НомерЛиста	+ 1;
								ЛистовЗаДень	= ЛистовЗаДень	+ 1;
								ЛистовЗаМесяц	= ЛистовЗаМесяц	+ 1;
								ЛистовЗаГод		= ЛистовЗаГод	+ 1;
								//ОбластьМакетаШапка.Параметры.ТекстНомерЛиста = НомерЛиста;
								ДокРезультат.Вывести(ОбластьМакетаШапка);
								ДокРезультат.Присоединить(ОбластьМакетаШапка);						
								ПриходРасходПоЛисту = Новый Соответствие();
							КонецЕсли;
						Исключение
						КонецПопытки;	
						
						ДокРезультат.Вывести(ОбластьМакетаСтрока);
						ДокРезультат.Присоединить(ОбластьМакетаСтрока);
						счСтроки = счСтроки + 1;
						// Заполним структуру итогов по листу
						ПриходРасход = Неопределено;
						ПриходРасход = ПриходРасходПоЛисту.Получить(ВыборкаДокументы.Валюта);
						ПриходРасход = ?(ПриходРасход = Неопределено, Новый Структура("Приход,Расход",0,0), ПриходРасход);
						ПриходРасход.Приход = ПриходРасход.Приход + ВыборкаДокументы.Приход;
						ПриходРасход.Расход = ПриходРасход.Расход + ВыборкаДокументы.Расход;
						ПриходРасходПоЛисту.Вставить(ВыборкаДокументы.Валюта, ПриходРасход);
					КонецЦикла; // по документам 
					
					// Если у нас день растянулся на несколько листов, тогда выведем итог по последнему листу
					Если ЛистовЗаДень > 0 Тогда
						Для каждого ТекВалюта Из ПриходРасходПоЛисту Цикл
							Если Многовалютная Тогда
								ОбластьМакетаПеренос.Параметры.Валюта = " (" + ТекВалюта.Ключ + ")";
							КонецЕсли;
							ОбластьМакетаПеренос.Параметры.Заполнить(ТекВалюта.Значение);
							ДокРезультат.Вывести(ОбластьМакетаПеренос);
							ДокРезультат.Присоединить(ОбластьМакетаПеренос);
						КонецЦикла;
					КонецЕсли; 
					
					//составление надписи подвала для приходных и расходных ордеров
					ЕстьПриходный = Ложь;
					ЕстьРасходный = Ложь; 
					Если ВыборкаДни.КоличествоПриходных = 0 Тогда    
						ЕстьПриходный = Истина;
						ПриходныеПолучил = Символ(8211)+ " приходных";
					ИначеЕсли ВыборкаДни.КоличествоПриходных = 1 Тогда
						ЕстьПриходный = Истина;
						ПриходныеПолучил = "один приходный";
					ИначеЕсли ВыборкаДни.КоличествоПриходных > 1 Тогда
						ЕстьПриходный = Истина;
						ПриходныеПолучил = НРег(ЧислоПрописью(ВыборкаДни.КоличествоПриходных,"НД=Ложь",",,,,,,,,0")) + "приходных";
					КонецЕсли; 
					Если ВыборкаДни.КоличествоРасходных = 0 Тогда    
						ЕстьРасходный = Истина;
						РасходныеПолучил = Символ(8211)+ " расходных";
					ИначеЕсли ВыборкаДни.КоличествоРасходных = 1 Тогда
						ЕстьРасходный = Истина;
						РасходныеПолучил = "один расходный";
					ИначеЕсли ВыборкаДни.КоличествоРасходных > 1 Тогда
						ЕстьРасходный = Истина;
						РасходныеПолучил = НРег(ЧислоПрописью(ВыборкаДни.КоличествоРасходных,"НД=Ложь",",,,,,,,,0")) + "расходных";
					КонецЕсли; 
					Если ЕстьПриходный И ЕстьРасходный Тогда    
						ВставкаИ = " и ";
					Иначе
						ВставкаИ = "";
					КонецЕсли; 
					ОбластьМакетаПодвал.Параметры.НадписьКолПриходныхРасходных = ПриходныеПолучил + ВставкаИ + РасходныеПолучил + " получил.";
					
					// Выводя подвальные секции, проверим, не перескочили ли мы на следующую страницу
					МассивПроверки = Новый Массив();
					Для Каждого СтрокаИтогиВалюты Из ВыборкаИтогиВалюты Цикл
						МассивПроверки.Добавить(ОбластьМакетаОборот);					
						МассивПроверки.Добавить(ОбластьМакетаКонечныйОстаток);								
					КонецЦикла;
					МассивПроверки.Добавить(ОбластьМакетаПодвал);
					
					// вычислим, возможно это последний в месяце день или в году, тогда выведем количество листов
					ПоследнийВМесяце = Ложь; ПоследнийВГоду = Ложь;
					Если сч = Количество Тогда
						Если пкПоследнийЛист > 0 Тогда
							ПоследнийВМесяце = Истина;
							МассивПроверки.Добавить(ОбластьМакетаЛистовЗаМесяц);
							
							//Если пкПоследнийЛист = 1 Тогда ПоследнийВГоду = ЛОЖЬ; КонецЕсли;
							ПоследнийВГоду = НЕ (пкПоследнийЛист = 1);
							
							Если ПоследнийВГоду Тогда
								МассивПроверки.Добавить(ОбластьМакетаЛистовЗаГод);
							КонецЕсли;
						Иначе
							ПоследнийВМесяце	= ЛОЖЬ;
							ПоследнийВГоду		= ЛОЖЬ;
						КонецЕсли;
					Иначе
						Если счДеньГода = КоличествоДнейВГоду Тогда
							ПоследнийВГоду = Истина;
							МассивПроверки.Добавить(ОбластьМакетаЛистовЗаГод);
						КонецЕсли;
						Если счДеньМесяца = КоличествоДнейВМесяце Тогда
							ПоследнийВМесяце = Истина;
							МассивПроверки.Добавить(ОбластьМакетаЛистовЗаМесяц);
						КонецЕсли;
					КонецЕсли;
					
					Попытка
						РезультатПроверки = ДокРезультат.ПроверитьВывод(МассивПроверки);
						Если НЕ РезультатПроверки Тогда
							НомерЛиста 		= НомерЛиста + 1;
							ЛистовЗаМесяц 	= ЛистовЗаМесяц + 1;
							ЛистовЗаГод 	= ЛистовЗаГод + 1;
							//ОбластьМакетаШапка.Параметры.ТекстНомерЛиста = НомерЛиста;
						КонецЕсли;
					Исключение
					КонецПопытки;	
					
					//Выведем все обороты по валютам  
					Для Каждого СтрокаИтогиВалюты Из ВыборкаИтогиВалюты Цикл
						ОбластьМакетаОборот.Параметры.ПриходЗаДень = СтрокаИтогиВалюты.ПриходЗаДень;
						ОбластьМакетаОборот.Параметры.РасходЗаДень = СтрокаИтогиВалюты.РасходЗаДень;					
						Если Многовалютная Тогда
							ОбластьМакетаОборот.Параметры.Валюта = " (" + СтрокаИтогиВалюты.Валюта + ")";					
						КонецЕсли;
						ДокРезультат.Вывести(ОбластьМакетаОборот);
						ДокРезультат.Присоединить(ОбластьМакетаОборот);					
					КонецЦикла;
					
					//Выведем все остатки на конец дня по валютам 
					Для Каждого СтрокаИтогиВалюты Из ВыборкаИтогиВалюты Цикл
						ОбластьМакетаКонечныйОстаток.Параметры.ОстатокКонец = СтрокаИтогиВалюты.КонечныйОстаток;
						Если Многовалютная Тогда
							ОбластьМакетаКонечныйОстаток.Параметры.Валюта = " (" + СтрокаИтогиВалюты.Валюта + ")";										
						КонецЕсли;
						ДокРезультат.Вывести(ОбластьМакетаКонечныйОстаток);
						ДокРезультат.Присоединить(ОбластьМакетаКонечныйОстаток);					
					КонецЦикла;
					
					ДокРезультат.Вывести(ОбластьМакетаПодвал);
					ДокРезультат.Присоединить(ОбластьМакетаПодвал);				
					
					Если сч = Количество Тогда //Это вообще последний лист в печати
						Если ПечатьОбложки Тогда
							// Печать обложки и титульного листа
							ДокументОбложка = Новый ТабличныйДокумент;
							ОбластьОбложка = МакетОбложки.ПолучитьОбласть("Обложка");
							ОбластьОбложка.Параметры.ПредставлениеОрганизации = спПолучитьПредставление(Организация);
							ОбластьОбложка.Параметры.Организация = Организация;						
							ОбластьОбложка.Параметры.НадписьОбложка = " на " + ?(МесяцОтчета <> Неопределено, МесяцОтчета + " ", "") + Формат(Год(ВыборкаДни.Период),"ЧГ=0") + " г.";
							ОбластьОбложка.Параметры.КодОКПО = Организация.КодПоОКПО;	
							ДокументОбложка.Вывести(ОбластьОбложка);
							ДокументОбложка.ВывестиГоризонтальныйРазделительСтраниц();
							ДокументОбложка.Вывести(ОбластьОбложка);
							//Последний лист кассовой книги
							ДокументОбложка.ВывестиГоризонтальныйРазделительСтраниц();
							ОбластьПослДеньГода = МакетОбложки.ПолучитьОбласть("ПослДеньГода");
							ОбластьПослДеньГода.Параметры.ГлавныйБухгалтерПредставление = ГлавныйБухгалтер;
							ОбластьПослДеньГода.Параметры.ГлавныйБухгалтер = ГлавныйБухгалтер;						
							ОбластьПослДеньГода.Параметры.РуководительПредставление = Руководитель;
							ОбластьПослДеньГода.Параметры.Руководитель = Руководитель;						
							ОбластьПослДеньГода.Параметры.РуководительДолжность = ?(ОбЗначениеНеЗаполнено(Руководитель),"",Руководитель.Должность);
							ОбластьПослДеньГода.Параметры.ЛистовЗаГод = ЛистовЗаГод;
							ДокументОбложка.Вывести(ОбластьПослДеньГода);
							ДокументОбложка.ОтображатьСетку = Ложь;
							ДокументОбложка.ОтображатьЗаголовки = Ложь;
							ДокументОбложка.ТолькоПросмотр = Истина;
							ДокументОбложка.Показать("Обложка и титульный лист кассовой книги","");
						КонецЕсли;
					КонецЕсли;
					
					Если ПоследнийВМесяце Тогда
						ОбластьМакетаЛистовЗаМесяц.Параметры.НадписьЛистовЗаМесяц = "Количество листов кассовой книги за месяц: " + ЛистовЗаМесяц;
						ДокРезультат.Вывести(ОбластьМакетаЛистовЗаМесяц);
						ДокРезультат.Присоединить(ОбластьМакетаЛистовЗаМесяц)					
					КонецЕсли;
					
					Если ПоследнийВГоду Тогда
						ОбластьМакетаЛистовЗаГод.Параметры.НадписьЛистовЗаГод = "Количество листов кассовой книги за год: " + ЛистовЗаГод;
						ДокРезультат.Вывести(ОбластьМакетаЛистовЗаГод);
						ДокРезультат.Присоединить(ОбластьМакетаЛистовЗаГод);					
					КонецЕсли;
					
					// Сохраним значение с количеством листов
					Если ПересчитыватьНомера Тогда
						ДеньЛиста = Номера.Добавить();					
					Иначе
						ДеньЛиста = РегистрыСведений.НомераЛистовКассовойКниги.СоздатьМенеджерЗаписи();
					КонецЕсли;
					ДеньЛиста.Период = ВыборкаДни.Период;
					ДеньЛиста.КассаКомпании = КассаКомпании;
					ДеньЛиста.НомерЛиста = ЛистовЗаГод;
					Если Не ПересчитыватьНомера Тогда
						ДеньЛиста.Записать();	
					КонецЕсли;
					//переход на следующий день
					ДокРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					//если номера пересчитываем, а дата начала еще не настала то необходимо очистить документ
					Если ПересчитыватьНомера И ВыборкаДни.Период < НачалоДня(ДатаНачала) Тогда
						ДокРезультат.Очистить();
					КонецЕсли;	
					НомерЛиста 		= НомерЛиста + 1;
					ЛистовЗаМесяц	= ЛистовЗаМесяц + 1;
					ЛистовЗаГод		= ЛистовЗаГод + 1;
					//ОбластьМакетаШапка.Параметры.ТекстНомерЛиста = НомерЛиста;	
				КонецЦикла; // по дням
				ЛистовЗаМесяц = 1;							
			КонецЦикла; // по месяцам 
			ЛистовЗаГод = 1;
			НомерЛиста = 1;
			// Сохраним созданный набор записей
			Если ПересчитыватьНомера Тогда
				Номера.Записать();
			КонецЕсли;
		КонецЦикла; // по годам
		КонецЕсли;
		Возврат ДокРезультат;
КонецФункции // СформироватьТабличныйДокумент()


//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

отОтчетПриИнициализацииОбъекта(ЭтотОбъект);
ДатаНачала = РабочаяДата;
МассивМесяцев = Новый Массив;
МассивМесяцев.Вставить(1,"январь");
МассивМесяцев.Вставить(2,"февраль");
МассивМесяцев.Вставить(3,"март");
МассивМесяцев.Вставить(4,"апрель");
МассивМесяцев.Вставить(5,"май");
МассивМесяцев.Вставить(6,"июнь");
МассивМесяцев.Вставить(7,"июль");
МассивМесяцев.Вставить(8,"август");
МассивМесяцев.Вставить(9,"сентябрь");
МассивМесяцев.Вставить(10,"октябрь");
МассивМесяцев.Вставить(11,"ноябрь");
МассивМесяцев.Вставить(12,"декабрь");

Организация = Справочники.Организации.ОсновнаяОрганизация;

#КонецЕсли
